Autodesk.Revit.DB.FabricationMaterialType
An enumerated type listing all fabrication material types.

Autodesk.Revit.DB.FabricationMaterialType.Containment
Containment material type (index/specification name)

Autodesk.Revit.DB.FabricationMaterialType.Pipework
Pipework material type (index/specification name)

Autodesk.Revit.DB.FabricationMaterialType.Ductwork
Flatbed material type (thickness/wire gauge)

Autodesk.Revit.DB.FabricationMaterialType.Unknown
Unknown material type